app/Models/Traits/ActiveUserHelper.php

select * from `users` where `users`.`id` = '5' limit 1
---
    private function calculateActiveUsers()
    {
        $this->calculateTopicScore();
        $this->calculateReplyScore();

        //数组按照得分排序
        $users = array_sort($this->users, function ($user) {
            return $user['score'];
        });

        //倒叙排序，保持key不变
        $users = array_reverse($users, true);

        //获取想要数据
        $users = array_slice($users, 0, $this->user_number, true);

        $active_users = collect();

        foreach($users as $user_id => $user) {
            $user = $this->find($user_id);

select user_id, count(*) as topic_count from `topics` where `created_at` >= '2018-11-10 00:51:44' group by `user_id`
---
    private function calculateTopicScore()
    {
        // 从话题数据表里取出限定时间范围（$pass_days）内，有发表过话题的用户
        // 并且同时取出用户此段时间内发布话题的数量
        $topic_users = Topic::query()->select(DB::raw('user_id, count(*) as topic_count'))
                                     ->where('created_at', '>=', Carbon::now()->subDays($this->pass_days))
                                     ->groupBy('user_id')
                                     ->get();

select user_id, count(*) as reply_count from `replies` where `created_at` >= '2018-11-10 00:51:44' group by `user_id`
---
    private function calculateReplyScore()
    {
        // 从回复数据表里取出限定时间范围（$pass_days）内，有发表过回复的用户
        // 并且同时取出用户此段时间内发布回复的数量
        $reply_users = Reply::query()->select(DB::raw('user_id, count(*) as reply_count'))
            ->where('created_at', '>=', Carbon::now()->subDays($this->pass_days))
            ->groupBy('user_id')
            ->get();